#+Title: The Advent of Code 2020
#+Author: Mark Armstrong
#+Description: A daily coding puzzle challenge from December 2020.
#+Description: My solutions implemented in Scala.
#+Setupfile: ./org-html-themes/org/theme-readtheorg-local.setup
#+Options: num:nil

** ~spans~: breaking up a list into a list of lists
:PROPERTIES:
:CUSTOM_ID: ~spans~:-breaking-up-a-list-into-a-list-of-lists
:END:

In some puzzzles, the input is grouped into lines
separated by one or more newlines.
For this, it's useful to be able to break a list into
a list of lists based on some predicate on the elements.
This is a generalisation of the ~span~ method,
which usually breaks a list into a tuple consisting of the largest
prefix of a list for which no elements satisfy the given predicate
and the remainder of the list.
Our new ~spans~ method breaks the list at every element which satisfies
the given predicate; note that the “breaking” elements are
included as singleton lists; this seems in spirit with the ~span~ method,
though I will usually want to filter them out in my usage.
#+begin_src amm :tangle ./src/advent-of-code-2020/resources.sc
def spans[A](l: List[A], p: A => Boolean): List[List[A]] = l match {
  case Nil => Nil
  case _ => l.span(p) match {
    case (Nil, Nil) => Nil
    case (Nil, breaker :: rest) => List(breaker) :: spans(rest, p)
    case (first, rest) => first :: spans(rest,p)
  }
}
#+end_src

#+RESULTS:
: defined function spans

*** The workhorses
:PROPERTIES:
:CUSTOM_ID: The-workhorses
:END:

The intuitive solution is to perform a a double walkthrough
of the list; walk through and, at each element ~e~,
perform another walkthrough and at each element ~e'~,
check if the sum of ~e~ and ~e'~ is the specified constant ~2020~.

Rather than perform the second walkthrough manually, we make use of
the ~collectFirst~ method for sequences;
see the sequence [[https://www.scala-lang.org/api/2.12.0/scala/collection/Seq.html][documentation]].
#+name: summingPair
#+begin_src amm
/**
  * Find a pair of elements in `xs` which sum to `sum`,
  * if such elements exist.
  * If multiple such pairs exist, returns the pair
  * whose first element has the lowest index and
  * whose second element has the lowest index amongst
  * candidates to pair with that first element.
  */
def summingPair(xs : Seq[Int], sum: Int): Option[Tuple2[Int,Int]] = xs match {
  case Nil => None
  case fst :: rest =>
    rest.collectFirst({case snd if fst + snd == sum => (fst,snd)}) match {
      case Some(pair) => Some(pair)
      case None => summingPair(rest, sum)
    }
}
#+end_src

#+RESULTS: summingPair
: defined function summingPair

*** The workhorse
:PROPERTIES:
:CUSTOM_ID: The-workhorse
:END:

This generalisation of the problem requires that we move away
from the use of a tuple; of course we could move to a triple instead,
but we may as well generalise to returning a sequence of a given length.

This time we will need to recurse on the new argument ~n~ when
for the inner “loop”.
#+name: summingSeq
#+begin_src amm
/**
 ,* Find a sequence of elements of length `n`
 ,* in `xs` which sum to `sum`,
 ,* if such elements exist.
 ,* If multiple such sequences exist, returns the sequence
 ,* whose first element has the lowest index and
 ,* whose second element has the lowest index amongst
 ,* candidates to pair with that first element, etc.
 ,*/
def summingSeq(xs : Seq[Int], sum: Int, n:Int): Either[String,List[Int]] = n match {
  case 0 if sum == 0 => Right(Nil)
  case 0             => Left("Ran out of return space with some leftover amount.")
  case n if n > 0 => xs match {
    case Nil => Left("Ran out of elements with some leftover amount.")
    case fst :: rest if sum >= fst =>
      summingSeq(rest, sum-fst, n-1) match {
        case Right(ys) => Right(fst :: ys)
        case Left(_) => summingSeq(rest,sum,n)
      }
    case _ :: rest => summingSeq(rest,sum,n)
  }
  case n if n < 0 => Left("Cannot sum many negative elements")
}
#+end_src

#+RESULTS: summingSeq
: defined function summingSeq

*** The workhorses
:PROPERTIES:
:CUSTOM_ID: The-workhorses
:END:

We require a parser for each line of the input.
This takes the string giving the password policy and the password,
and returns ~true~ or ~false~ based on whether the password
satisfies that policy.

This requires the use of regular expressions to break the string
into its parts, and a character counting method.
#+name: policy-handlers
#+begin_src amm
def parsePolicy(s: String): Tuple4[Int,Int,Char,String] = {
  val pattern = "([0-9]+)-([0-9]+) ([A-Za-z]): ([A-Za-z]+)".r
  val pattern(low, high, c, pass) = s
  return (low.toInt,high.toInt,c.head,pass)
}

def satisfiesPolicy(s : String): Boolean = {
  val (low,high,c,pass) = parsePolicy(s)
  val occurrences = pass.count(_ == c)
  return low <= occurrences && occurrences <= high
}
#+end_src

#+RESULTS:
: defined function parsePolicy
: defined function satisfiesPolicy

*** The workhorses
:PROPERTIES:
:CUSTOM_ID: The-workhorses
:END:

We begin with a general method to shrink “binary spaces”.
Given a range, and a list of “increase lower/decrease upper”
commands, we return a new range resulting from
applying the commands.
#+name: shrinkBinSpace
#+begin_src amm
sealed trait BinSpaceModifier
case object IncreaseLower extends BinSpaceModifier
case object DecreaseUpper extends BinSpaceModifier

def shrinkBinSpace(space: Tuple2[Int,Int],
                   c: List[BinSpaceModifier]):
    Tuple2[Int,Int] = c match {
  case Nil => space
  case IncreaseLower :: rest => {
    val lower = space._1
    val upper = space._2
    val increased = ((upper + lower).toFloat / 2).ceil.toInt
    shrinkBinSpace(Tuple2(increased,upper), rest)
  }
  case DecreaseUpper :: rest => {
    val lower = space._1
    val upper = space._2
    val decreased = ((upper + lower).toFloat / 2).floor.toInt
    shrinkBinSpace(Tuple2(lower,decreased), rest)
  }
}
#+end_src

#+RESULTS: shrinkBinSpace
: defined trait BinSpaceModifier
: defined object IncreaseLower
: defined object DecreaseUpper
: defined function shrinkBinSpace

Now, we need only convert the strings into two lists
of such commands.
Since we know the exact form of the input strings,
this method is quite exact; not generally useful.
#+name: parseSeatCode
#+begin_src amm
def parseSeatCode(code: String):
    Tuple2[List[BinSpaceModifier],List[BinSpaceModifier]] = {
  val (rowLetters, columnLetters) = code.splitAt(7)
  val rowCommands = rowLetters.map(l => l match {
    case 'F' => DecreaseUpper
    case 'B' => IncreaseLower}).toList
  val columnCommands = columnLetters.map(l => l match {
    case 'L' => DecreaseUpper
    case 'R' => IncreaseLower}).toList

  Tuple2(rowCommands,columnCommands)
}
#+end_src

#+RESULTS: parseSeatCode
: defined function parseSeatCode

